In [1]:
import pandas as pd

In [2]:
exam=pd.read_csv('exam.csv')

In [3]:
exam.query('nclass ==1')

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

In [4]:
exam.query('nclass ==3')

    id  nclass  math  english  science
8    9       3    20       98       15
9   10       3    50       98       45
10  11       3    65       65       65
11  12       3    45       85       32

In [5]:
exam.query('math>50')

    id  nclass  math  english  science
1    2       1    60       97       60
6    7       2    80       90       45
7    8       2    90       78       25
10  11       3    65       65       65
14  15       4    75       56       78
15  16       4    58       98       65
16  17       5    65       68       98
17  18       5    80       78       90
18  19       5    89       68       87
19  20       5    78       83       58

In [6]:
exam.query('nclass==1&math>50')

   id  nclass  math  english  science
1   2       1    60       97       60

In [7]:
nclass1 = exam.query('nclass==1')
nclass2 = exam.query('nclass==2')

In [8]:
nclass1

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

In [9]:
nclass1['math'].mean()

46.25

In [10]:
nclass1['math'].sum()

185

In [11]:
a = pd.DataFrame([1,2,3,4,5],[40,50,21,56,72],column={'id','mid'})

b = pd.DataFrame({'id':[1,2,3,4,5],
                 'final':[40,60,80,30,80]})

TypeError: __init__() got an unexpected keyword argument 'column'